print("Калькулятор площади прямоугольника\n Если хотите выйти, введите q")

# Запускаем цикл
while True:
    input_x=input("Введите сторону x или q, если хотите выйти: ")


# Проверка на продолжение цикла или прерывание   
    if input_x.lower() in ['q']:
        print("Програма завершена.")
        break


    input_y=input("Введите сторону y или q, если хотите выйти: ")


    if input_y.lower() in ['q']:
        print("Програма завершена.")
        break
    

# Вычисляем площадь
    try:
        x=float(input_x)
        y=float(input_y)
        sqr=x*y
        print(f"Площадь треугольника {sqr}\n")
# Проверка на правильный тип данных
    except ValueError:
        print("Ошибка! Пожалуйста, вводите только числа.\n")
